#ifndef	_KBD_AT_SET2_H
#define _KBD_AT_SET2_H  1
// AT keyboard scancode set 2

static const char const KBD_CODE_MAP[] = ""
"ÿÿÿÿÿÿÿÿÿÿÿÿÿ\t`ÿ"
"ÿÿÿÿÿq1ÿÿÿzsaw2ÿ"
"ÿcxde43ÿÿ vftr5ÿ"
"ÿnbhgy6ÿÿÿmju78ÿ"
"ÿ,kio09ÿÿ./l;p-ÿ"
"ÿÿ'ÿ[=ÿÿÿÿ\n]ÿ\\ÿÿ"
"ÿÿÿÿÿÿ\bÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"";

static const char const KBD_CODE_MAP_SHIFT[] = ""
"ÿÿÿÿÿÿÿÿÿÿÿÿÿ\t~ÿ"
"ÿÿÿÿÿQ!ÿÿÿZSAW@ÿ"
"ÿCXDE$#ÿÿ VFTR%ÿ"
"ÿNBHGY^ÿÿÿMJU&*ÿ"
"ÿ<KIO)(ÿÿ>?L:P_ÿ"
"ÿÿ\"ÿ{+ÿÿÿÿ\n}ÿ|ÿÿ"
"ÿÿÿÿÿÿ\bÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ"
"";

#endif // _KBD_AT_SET2_H